app/controllers/boats_controller.rb

SELECT "boats".* FROM "boats" WHERE (capacity > 5 OR capacity = 5)
SELECT "boats".* FROM "boats" WHERE "boats"."state" = ? AND "boats"."city" = ? AND (capacity > 9)  [["state", "Alaska"], ["city", "Adak"]]
---
  def index
    @boats = Boat.all
    #filtering, may suffer from SQL injection.
    #https://www.justinweiss.com/articles/search-and-filter-rails-models-without-bloating-your-controller/
    @boats = @boats.state(params[:state]) if params[:state].present?
    @boats = @boats.city(params[:city]) if params[:city].present?

INSERT INTO "boats" ("name", "description", "available_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "hs"], ["description", "kkk"], ["available_date", "10/25/2017,10/08/2017"], ["created_at", "2017-10-23 04:31:15.829895"], ["updated_at", "2017-10-23 04:31:15.829895"]]
INSERT INTO "boat_attachments" ("image", "boat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "boat1.jpg"], ["boat_id", 2], ["created_at", "2017-10-20 22:22:27.994019"], ["updated_at", "2017-10-20 22:22:27.994019"]]
---
  def create
    @boat = Boat.new(boat_params)
    @boat.owner_name = current_user.first_name + ' ' + current_user.last_name
    @boat.ownerid = current_user.id
    @boat.file_link = params[:boat][:file_position]
    @boat.video_link = params[:boat][:video_position]

    respond_to do |format|

      if @boat.save
        params[:boat_attachments]['image'].each do |a|
          @boat_attachment = @boat.boat_attachments.create!(:image => a)

UPDATE "boats" SET "available_date" = ?, "updated_at" = ? WHERE "boats"."id" = ?  [["available_date", "10/10/2017,10/20/2017"], ["updated_at", "2017-10-23 05:56:21.116925"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @boat.update(boat_params)

DELETE FROM "boats" WHERE "boats"."id" = ?  [["id", 1]]
---
  def destroy
    @boat.destroy

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT 1  [["id", nil]]
---
  def set_boat
    @boat = Boat.find(params[:id])