app/controllers/boat_attachments_controller.rb

SELECT "boat_attachments".* FROM "boat_attachments"
---
  def index
    @boat_attachments = BoatAttachment.all

UPDATE "boat_attachments" SET "image" = ?, "updated_at" = ? WHERE "boat_attachments"."id" = ?  [["image", "boat2.jpg"], ["updated_at", "2017-10-20 22:23:39.187164"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @boat_attachment.update(boat_attachment_params)

SELECT  "boat_attachments".* FROM "boat_attachments" WHERE "boat_attachments"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_boat_attachment
      @boat_attachment = BoatAttachment.find(params[:id])