app/controllers/boats_controller.rb

  def show
    @boat_attachments = @boat.boat_attachments.all
---
SELECT "boat_attachments".* FROM "boat_attachments" WHERE "boat_attachments"."boat_id" = ?  [["boat_id", 2]]