app/controllers/home_page_controller.rb

  def index
    @boats = Boat.all
---
SELECT "boats".* FROM "boats"  ORDER BY created_at DESC