app/controllers/registrations_controller.rb

  def create
      @user = User.new(sign_up_params)
      respond_to do |format|
        if @user.save
          if params[:user][:isCaptain]
           @captain = @user.build_captain(
              {
                  #user_id: @user.id,
                  age: params[:user][:captains][:age],
                  year_experience: params[:user][:captains][:year_experience],
                  comments: params[:user][:captains][:comments],
                  first_available_date: params[:user][:captains][:first_available_date],
                  monday: params[:user][:captains][:monday],
                  tuesday: params[:user][:captains][:tuesday],
                  wednesday: params[:user][:captains][:wednesday],
                  thursday: params[:user][:captains][:thursday],
                  friday: params[:user][:captains][:friday],
                  saturday: params[:user][:captains][:saturday],
                  sunday: params[:user][:captains][:sunday],

              }).save(validate: false)
---
INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "address_line1", "address_line2", "city", "state", "zip_code", "isCaptain", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "captains" ("age", "year_experience", "comments", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["age", 18], ["year_experience", 0], ["comments", ""], ["user_id", 1], ["created_at", "2017-11-07 00:10:46.864099"], ["updated_at", "2017-11-07 00:10:46.864099"]]