app/controllers/rents_controller.rb

SELECT "rents".* FROM "rents" WHERE "rents"."boat_id" = ?  [["boat_id", 1]]
---
  def index
    @rents = Rent.where(boat_id: params[:boat_id])

INSERT INTO "rents" ("comments", "date_required", "boat_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comments", "oo"], ["date_required", "11/23/2017"], ["boat_id", 1], ["user_id", 1], ["created_at", "2017-11-19 14:16:56.203096"], ["updated_at", "2017-11-19 14:16:56.203096"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def create
    # Instantiate a new object using form parameters
    @rent = Rent.new(rent_params)
    @rent.boat_id = session[:boat_id]
    @rent.user_id = current_user.id
    @rent.user_name = current_user.first_name + ' ' + current_user.last_name
    # Save the object
    @boat = Boat.find(session[:boat_id])
    original_available = @boat.available_date.split(',')
    new_available = []
    required_date = params[:rent][:date_required].split(',')
    for date in original_available do
      is_same = false
      for r_date in required_date do
        if date == r_date
          is_same = true
          break
        end
      end
      if is_same == false
        new_available.push(date)
      end
    end
    new_available_date = new_available.join(',')

    if @rent.save
      # If save succeeds, redirect to the index action
      @boat.update_attributes({ :available_date => new_available_date})
      flash[:notice] = "Your order has been placed."
      session[:boat_name] = Boat.find(@rent.boat_id).name