app/controllers/users_controller.rb

  def my_boats
    @boats = Boat.where(ownerid: current_user.id)
---
SELECT "boats".* FROM "boats" WHERE "boats"."ownerid" = ?  [["ownerid", 1]]

  def my_rents
    @rents = Rent.where(user_id: current_user.id)
---
SELECT "rents".* FROM "rents" WHERE "rents"."user_id" = ?  [["user_id", 1]]